# 판다스, 데이터프레임, 시리즈 알아보기

In [3]:
import pandas as pd

In [4]:
data_frame = pd.read_csv('data/friend_list.csv')

In [5]:
# 컬럼들을 다른말로 series라고 부른다. 데이터프레임 series의 결합체이다.
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [6]:
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [7]:
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [8]:
type(data_frame.job)

pandas.core.series.Series

In [9]:
# series 생성
s1 = pd.core.series.Series([1,2,3])

In [10]:
s2 = pd.core.series.Series(['one','two','three'])

In [11]:
# 데이터프레임 생성
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three